Repository: oscarahalvorsen/masterproject
Catalog: datacollecting/MAALFRID/tmx/forsvaret.no.csv-en-nb.deduped.tmx
Source language: en
Languages: nb

source: describe communication models and the significance of various forms of communication in an inter-cultural context.
nb: beskrive kommunikasjonsmodeller og ulike kommunikasjonsformers betydning i en interkulturell kontekst.

source: • calculate Fourier series for simple functions
nb: • regne ut Fourierrekker for enkle funksjoner

source: Lectures, tests, compulsory laboratory assignments, assignment solving and compulsory exercises.
nb: Forelesninger, prøver, obligatoriske laboratorieoppgaver, oppgaveløsning og obligatoriske øvinger.

source: • Use of command, control and information systems (K2IS)
nb: • Bruk av kommando, kontroll og informasjonssystemer(K2IS)

source: Military Navigation 2 should teach relative course and speed early in semester 4.
nb: Militær navigasjon 2 bør undervise relativ kurs og fart primo i semester 4.

source: Bachelor in military studies with specialisation in leadership - Naval Engineering Weapons Branch
nb: Bachelor i militære studier med fordypning i ledelse - Marineingeniør våpensystemer, elektronikk og data

source: perform analyses of fuel oil and cooling water samples.
nb: forstå analyser av brennolje- og kjølevannsprøver.

source: digital engineering expertise, can work in relevant laboratories and masters measuring methods, troubleshooting methodology, the use of relevant instruments and software as a basis for targeted and innovative work as a cyber engineer.
nb: ingeniørfaglig digital kompetanse, kan arbeide i relevante laboratorier og behersker målemetoder, feilsøkingsmetodikk, bruk av relevante instrumenter og programvare, som grunnlag for målrettet og innovativt arbeid som cyberingeniør.

source: Compendium in course correction and set & drift calculations
nb: Kompendium i kursretting og strømkoblinger

source: demonstrate physical, mental and moral robustness and over time act in critical situations characterised by chaos and uncertainty, including be able to inflict losses on the enemy.
nb: vise fysisk, mental og moralsk robusthet og over tid virke i kritiske situasjoner preget av kaos og usikkerhet, herunder kunne påføre fienden tap.

source: Lectures, laboratory work, project work and the exercise "Cyberingeniør"
nb: Forelesninger, laboratoriearbeid, prosjektarbeid og Øvelse Cyberingeniør

source: cooperate efficiently in a multi-cultural department.
nb: samarbeide effektivt i en flerkulturell avdeling.

source: formulate and solve stochastic problems, both analytically and numerically, and evaluate and explain his/her results
nb: formulere og løse stokastiske problemer, både analytisk og numerisk, og vurdere og gjøre rede for sine resultater

source: • describe project and scientific method, and be able to relate these to research and development work in the Norwegian Armed Forces
nb: • beskrive prosjekt- og vitenskapelig metode, og kan relatere disse til forsknings- og utviklingsarbeid i Forsvaret

source: operating, maintaining, planning and disposing of relevant technical ship equipment in the Navy.
nb: drifte, vedlikeholde, prosjektere og avhende relevant skipsteknisk materiell i Sjøforsvaret.

source: The course is based on ING1503 Programming and digital technology.
nb: Emnet bygger på ING1503 Programmering og digitalteknikk.

source: Apply knowledge of the opportunities and limitations of the cyber domain in military operations at the tactical level, both in terms of CIS support operations and defensive and offensive capabilities in the cyber domain.
nb: Anvende kunnskap om muligheter og begrensninger cyberdomenet har på militære operasjoner på taktisk nivå, både når det gjelder CIS støtte operasjoner og defensive og offensive kapabiliteter i cyberdomenet.

source: The course is based on ING1501 The Cyber engineer’s profession, ING3501 Role and communication 1, “Introduction to military leadership” and OR5 education
nb: Emnet bygger på ING1501 Cyberingeniørens profesjon, ING3501 Rolle og kommunikasjon 1, «Innføring i militært lederskap» og OR5-utdanning

source: Here, it is planned that the supervisor will set aside up to 30 hours for the guidance of the individual student, depending on the individual's needs.
nb: Her er det lagt opp til at veileder skal avsette opptil 30 timer til veiledning av den enkelte student, avhengig av den enkeltes behov.

source: Meteorological/oceanographic reading material and films/video
nb: Meteorologisk / oseanografisk støttelitteratur samt film / video

source: - Critically analyze UN peace operations from a security policy perspective;
nb: - Kritisk analysere FNs fredsoperasjoner i et sikkerhetspolitisk perspektiv;

source: They can also use knowledge and reflections from lectures, group discussions and case studies.
nb: Man kan også benytte kunnskap og refleksjoner fra forelesninger, gruppediskusjoner og case-studier.

source: Based on relevant research in logistics and Defence Supply Chain Management, national and NATO doctrines and concepts, as well as experience-based knowledge at the operational level, the module addresses how logistics are planned, managed and carried out during formations and during the Norwegian Armed Forces’ operations.
nb: Med basis i relevant forskning innen logistikk og Defence Supply Chain Management, NATOs og nasjonale doktriner og konsepter samt erfaringsbasert kunnskap på operasjonelt nivå tar modulen for seg hvordan logistikk planlegges, ledes og gjennomføres under styrkeoppbygging og under Forsvarets operasjoner.

source: to provide the cadets with a basic understanding of their own and others’ level of maturity.
nb: gi kadettene grunnleggende forståelse for eget og andre teams modenhetsnivå.

source: Convey their knowledge of civil engineering and military sciences to different target audiences both written and verbally in Norwegian and English.
nb: Formidle byggteknisk og militærfaglig kunnskap til ulike målgrupper både skriftlig og muntlig på norsk og engelsk, og bidra til å synliggjøre teknologiens betydning og konsekvenser.

source: This course runs parallel with the MPN 4 Ryfylke exercise.
nb: Dette kurset går parallellt med MPN 4 Øvelse Ryfylke.

source: knowledge of navigation planning aids
nb: kjennskap til kystadministrasjon og losing

source: Identify political, demographic and cultural conditions that may affect military mission resolutions in a given area of operations.
nb: tilpasse militær oppdragsløsning til politiske, kulturelle, kommunikative, historiske, rettslige, og etiske forhold i et operasjonsmiljø.

source: The basic part of the IMO module course 1.27 ECDIS is completed as a module in semester 2, followed by practical experience on board the school vessels (the Blindleia exercise) so that the cadets receive the necessary ECDIS training as early as possible in the course of their education.
nb: Den grunnleggende delen av IMO modulkurs 1.27 ECDIS gjennomføres som modul i semester 2 etterfulgt av praksis om bord på skolefartøyene (Øv Vestkyst) slik at elevene får nødvendig ECDIS opplæring så tidlig som mulig i utdanningsløpet.

source: Beyond this, self-study under supervision will be the basis for a common methodological approach within the course, both for teams and individuals.
nb: Ved bruk av forskjellige lærings- og refleksjonsmetoder i forkant, underveis og i etterkant av større og mindre praksisarenaer forsterkes individuell og kollektiv læring og utvikling (læringskompetanse).

source: describe management of military Communication and Information Systems (CIS) – and cyber operations nationally and internationally.
nb: beskrive ledelse av militære Communication and Information Systems(CIS)- og cyberoperasjoner nasjonalt og internasjonalt.

source: The purpose of the course is to provide the students with a cultural understanding and inter-cultural communication skills as a basis for international operations and cooperation.
nb: Hensikten med emnet er å tilføre studentene kulturforståelse og interkulturelle kommunikasjonsferdigheter som grunnlag for internasjonale operasjoner og samarbeid.

source: At the end of the week, students submit the course's second work requirements (individual submission).
nb: Som avslutning på uken innleverer studentene emnets andre arbeidskrav (individuell innlevering).

source: summarise safe management and operation of auxiliary systems in simulator and in laboratory.
nb: gjennomføre sikker operering og drift av hjelpesystemer på simulator og i laboratoriet.

source: demonstrate a basic attitude to own and others’ culture and religion characterised by respect, security, openness and tolerance.
nb: demonstrere en grunnholdning til egen og andres kultur og religion preget av respekt, trygghet, åpenhet og toleranse.

source: Ditlefsen: Chapter H. The Norwegian Pilot: volume 1, chapter II.
nb: Den norske los: bind 1 kapittel II.

source: Simulator exercises 1 to 7 in semester 5.
nb: Simulatorøvingene 1 til 7 i semester 5.

source: The ship's geometry and hydrostatics:
nb: Skipets geometri og hydrostatikk:

source: The bachelor's degree in military studies with specialisation in management - naval power and military navigation, combined with the necessary practical training, prepares officers for serving at the lower to middle levels of the Navy and the Armed Forces, in both wartime and peacetime command structures.
nb: Bachelor i militære studier med fordypning i ledelse - sjømakt og militær navigasjon, kombinert med nødvendig funksjonsrettet utdanning, forbereder offiserene til å kunne tjenestegjøre på lavere og midlere nivå i Sjøforsvaret og Forsvaret, i både krigs- og fredsoppsetninger.

source: perform calculations in Octave with algorithms (correlation, modulation, DFT, inverse DFT and FFT) for digital signal processing
nb: utføre beregninger i Octave med algoritmer (korrelasjon, modulasjon, DFT, invers DFT og FFT) for digital signalbehandling

source: • Basic directors and radar
nb: • Grunnleggende bølgeledere og radar

source: The main part of the work takes place in semester VI, where the thesis topic is first approved and an academic supervisor is appointed.
nb: Hoveddelen av arbeidet foregår i semester VI, hvor det starter med godkjenning av oppgavetekst og tildeling av faglig veileder.

source: Introduction to auxiliary systems, regulator and sensors for a diesel engine.
nb: Innføring i hjelpesystemer, regulator og sensorer for en dieselmotor.

source: discuss leadership as a phenomenon, specifically in relation to military leadership and management.
nb: drøfte fremtredende dilemmaer og utfordringer knyttet til lederskap og styring av, og i Forsvaret.

source: Introduction to key developments within air force theory, technology and application.
nb: Innføring i sentrale utviklingstrekk innenfor luftmilitær teori, teknologi og anvendelse.

source: • perform calculations in Octave with algorithms (folding, correlation, modulation, DFT, inverse DFT and FFT) for digital signal processing
nb: • utføre beregninger i Octave med algoritmer (folding, korrelasjon, modulasjon, DFT, invers DFT og FFT) for digital signalbehandling

source: Writing a Master's thesis should follow recognized scientific principles for literature references.
nb: Skriving av masteroppgave skal følge anerkjente vitenskapelig prinsipper for litteraturhenvisninger.

source: Power transmission in hydraulic systems, control machines and turning propeller systems.
nb: Kraftoverføring i hydrauliske systemer, styremaskiner og vridbare propelleranlegg.

source: describe the culture’s and language’s (verbal/non-verbal) significance in multinational departments and staffs.
nb: beskrive kulturens og språkets (verbal/nonverbal) betydning i flernasjonale avdelinger og staber.

source: As a prelude to the students' analysis of SACEUR's Strategic Assessment (SSA), the students are briefed on this scenario and the background of the conflict, with emphasis on political perspectives and objectives.
nb: Som en opptakt til studentenes analyse av SACEUR’s Strategic Assessment (SSA), får studentene en orientering om dette scenarioet og konfliktbakgrunnen, med hovedvekt på politiske perspektiver og målsettinger.

source: Including the international law framework that regulates that states can use the cyber domain for military purposes (Jus ad bellum / in bello)
nb: Herunder det folkerettslige rammeverket som regulerer at stater kan utnytte cyberdomenet til militære formål (Jus ad bellum/in bello)

source: calculate fittings and tolerances.
nb: beregne pasninger og toleranser.

source: Course materials and assignments are available on MS Teams and OneNote.
nb: Emnematerial og oppgaver finnes på MS Teams og OneNote.

source: Here, a 13-month basic education is completed, followed by three months of advanced training.
nb: Her gjennomføres en 13 måneder lang grunnutdanning, etterfulgt av tre måneder med avansert trening.

source: The study at CIS is further subject to the Regulations for Admission, Studies and Examinations at the Norwegian Defence University College.
nb: Videre er studiet ved CIS underlagt forskrift om opptak, studier og eksamen ved Forsvarets høgskole.

source: This section's main concern is to illuminate long lines within current Norwegian security and defence policy and how international and national conditions have given them expression.
nb: Denne delens hovedanliggende er så å belyse lange linjer i og aktuell norsk sikkerhets- og forsvarspolitikk og hvordan internasjonale og nasjonale forhold har gitt og gir seg uttrykk.

source: How can the UN be understood from a security policy perspective?
nb: Hvordan kan FN forstås i et sikkerhetspolitisk perspektiv?

source: Strength and fatigue analysis.
nb: Styrke og utmattingsanalyse.

source: Encounter frequency, response amplitude operator (RAO) and motion spectra.
nb: Møtefrekvens, Response Amplitude Operator (RAO) og bevegelsesspektre.

source: The candidate has knowledge of electric and magnetic fields, electrical components, circuits and systems.
nb: Kandidaten har kunnskap om elektriske og magnetiske felt, elektriske komponenter, kretser og systemer.

source: describe the functioning, possibilities and limitations of combat and marine technological systems.
nb: beskrive våpentekniske og skipstekniske systemers virkemåte, muligheter og begrensninger.

source: demonstrate broad knowledge that provides a comprehensive system perspective on engineering in general, with specialisation in electronics, computer and weapon technology subjects, aimed at the Navy’s needs.
nb: vise til bred kunnskap som gir et helhetlig systemperspektiv på ingeniørfaget generelt, med fordypning i elektronikk, data og våpentekniske emner, rettet mot Sjøforsvarets behov.

source: Simulation, emulation and debugging.
nb: Simulering, emulering og debugging.

source: contribute to new thinking, innovation, material, tactical development and new systems through participation in the development and realisation of sustainable products, tactics and/or solutions that are useful to the Armed Forces.
nb: bidra til nytenkning, innovasjon, materiell, taktikkutvikling og nye systemer gjennom deltakelse i utvikling og realisering av bærekraftige produkter, taktikker og/eller løsninger som er nyttig for Forsvaret.

source: Relevant IMO Conventions (SOLAS, MARPOL and Load Lines).
nb: Gjeldende IMO-konvensjoner (SOLAS, MARPOL og Lastelinje).

source: After completion of the course, the cadet is able to
nb: vurdere kvalitet i argumentasjon og kilder

source: As a basis for comparative analysis, the course acquaints students with defence planning processes in NATO and selected, other countries.
nb: Som basis for komparativ analyse gir emnet kjennskap til forsvarsplanleggingsprosesser i NATO og utvalgte, andre land.

source: Protecting civilians is the UN's most important task today.
nb: Beskyttelse av sivile er FNs viktigste oppgave i dag.

source: Modulation and demodulation.
nb: Modulasjon og demodulasjon.

source: The exercise was conducted digitally in spring 2020.
nb: Våren 2020 ble øvelsen gjennomført digitalt over to dager.

source: Bachelor in military studies with specialisation in management – Naval Engineer Machine, in combination with necessary functionally-oriented education, prepares the officers to serve at a lower and middle level in the Navy and the Armed Forces, in both war and peace setups.
nb: Bachelor i militære studier med fordypning i ledelse - marineingniør elektro, kombinert med nødvendig funksjonsrettet utdanning, forbereder offiserene til å kunne tjenestegjøre på lavere og midlere nivå i Sjøforsvaret og Forsvaret, i både krigs- og fredsoppsetninger.

source: Military sports and training (MIT) are taught in parallel with the individual self-chosen specialization subject.
nb: Militær idrett og trening (MIT) undervises parallelt med det enkelte selvvalgte fordypningsemne.

source: analyse and define the concepts of security and strategy.
nb: analysere og definere sikkerhetsbegrepet og strategibegrepet.

source: The RNAF's capacities, organisation and operational patterns, and how command and control are exercised in the RNAF
nb: Luftforsvarets kapasiteter, organisasjon og operasjonsmønstre, og hvordan kommando og kontroll utøves i Luftforsvaret

source: Section 4 - English is taught throughout the semester, in parallel with the specialization courses and MILM2405.
nb: Tema 4 - Engelsk undervises gjennom hele semesteret, parallelt med fordypningsemnene og MILM2405.

source: • Course in social conventions and social expectations of the officer/specialist
nb: Kan finne, vurdere og henvise til informasjon og fagstoff og framstille dette slik at det belyser en problemstilling

source: plan and conduct the collection, processing, analysis and presentation of geographical information
nb: planlegge og gjennomføre innsamling, bearbeiding, analyse og presentasjon av geografisk informasjon

source: Explain the army’s expectations and the duties of an officer.
nb: forklare Hærens forventninger og krav til offiseren.

source: apply knowledge and relevant results from research and development work to solve operational, theoretical, technical and practical issues within operational management on board and justify his/her choices.
nb: anvende kunnskap om og relevante resultater fra forsknings- og utviklingsarbeid for å løse operative, teoretiske, tekniske og praktiske problemstillinger innenfor operativ ledelse om bord og begrunne sine valg

source: Explain how different organisational models and organisational cultures affect your organisation.
nb: Forklare hvordan ulike organisasjonsmodeller og organisasjonskultur påvirker organisasjonen.

source: explain how requirements to survival ability, NATO regulations/standards, impacts machinery systems for naval vessels.
nb: forklare hvordan krav til overlevelsesevne, NATO regelverk/standarder, virker inn på maskinerisystemer til marinefartøy.

source: International naval power and naval warfare history
nb: Internasjonal sjømakt og sjøkrigshistorie

source: Steam turbines, design, dimensioning, operation characteristics, control and regulation, simulator exercise.
nb: Dampturbiner, konstruksjon, dimensjonering, driftskarakteristikker, kontroll og regulering., simulatorøvelse.

source: The first part of the practice 2 Course, will be reserved for work relating to the bachelor dissertation, which is described in Synthetic Training Course - Tactics, Leadership and Staff Service.
nb: Den første delen av emnet Praksis 2 vil være forbeholdt aktivitet tilknyttet bacheloroppgaven, som er beskrevet i emnet Syntese - taktikk, ledelse og stabssjeneste.

source: • state the norms for keeping laboratory records and technical report
nb: • angi normene for føring av laboratoriejournal og teknisk rapport

source: How can the UN be understood from a historical perspective?
nb: Hvordan kan FN forstås i et historisk perspektiv?

source: Complexity in MPN:
nb: Kompleksiteten i MPN:

source: Clutches and couplings between engine and propeller.
nb: Klutsjer og koblinger mellom motor og propell.

source: find, evaluate and refer to information and subject matter and present this so that it sheds light on a problem.
nb: finne, vurdere og henvise til informasjon og fagstoff samt framstille dette slik at det belyser en problemstilling.

source: use measurement equipment and simulation programmes in the laboratory and can present and interpret measurement data and simulated data.
nb: bruke måleutstyr og simuleringsprogrammer på laboratoriet og kan framstille og tolke måledata og simulerte data.

source: Navigation in low pressure systems The Norwegian Pilot, Volume 1, Chapter VII
nb: Navigasjon ifm lavtrykk. Den norske los bind 1 kapittel VII

source: Use of the Code for Safe Practice for Cargo Stowage and Securing (CSS Code)
nb: Bruk av the Code for Safe Practice for Cargo Stowage and Securing (CSS koden)

source: Dietlefsen: chapters M and N
nb: Dietlefsen: kapittel M og N

source: Military Civil Engineering
nb: militær bygg- og anleggsteknikk

source: Produce and present a poster (500 words maximum) that describes your idea for the essay (final exam)
nb: Presentasjon av poster m/ idéer til avsluttende essay (maks 500 ord)

source: Damage mechanisms and fault types in selected engine systems.
nb: Skademekanismer og feiltyper i utvalgte maskinerisystemer.

source: use a relevant mathematical symbol and formula system to manipulate symbols and formulas
nb: benytte et relevant matematisk symbol- og formelapparat og manipulere symboler og formler

source: This subject focuses on developing the English knowledge and skills of the cadets (written and spoken), whilst developing an understanding of intercultural communication and social power structures relevant to the NAF and the RNAF.
nb: Dette temaet fokuserer på å videreutvikle kadettenes engelskkunnskaper og -ferdigheter (muntlig og skriftlig) samtidig som de utvikler en forståelse for den interkulturell kommunikasjon og sosiale maktstrukturer relevante for Forsvaret og Luftforsvaret.

source: • Polar coordinates, cylindrical coordinates, spherical polar coordinates and general change of variables
nb: • Polarkoordinater, sylinderkoordinater, kulekoordinater og generelt variabelskifte

source: The cadets shall maintain the role of navigator on duty on board the school vessels and shall as a minimum:
nb: Kadettene skal ivareta rollen som daghavende navigatør om bord på skolefartøyene og skal som minimum:

source: 1) Road construction over approx. three weeks with one week theory and two weeks independent project work and training in use of Civil3D.
nb: 1) Veibygging i ca. tre uker med en uke teori og to uker selvstendig prosjektarbeid og opplæring i bruk og Civil3D.

source: Afterwards, MPN focuses on the radar control mode.
nb: Deretter fokuserer MPN på kontrollmoden Radar.

source: knowledge of requirements and solutions used in connection with Airfield Damage Repair (ADR)
nb: kunnskap om krav og løsninger som nyttes i forbindelse med Airfield Damage Repair (ADR)

source: be able to plan, direct and execute engineering assignments, in accordance with ethical requirements and guidelines in the Armed Forces
nb: kunne planlegge, lede og gjennomføre ingeniøroppdrag, i tråd med etiske krav og retningslinjer i Forsvaret

source: A total letter grade A-F is given in the course, based on the weighting of the decimal grades from three partial assessments.
nb: Det gis en samlet bokstavkarakter A-F i emnet, basert på vekting av desimalkarakterer fra tre delvurderinger.

source: Explain the context of technological innovation and its implications for leadership.
nb: beskrive konteksten rundt militær teknologisk innovasjon og forklare hvilken betydning dette har for ledelse.
